In [3]:
import pandas as pd

In [1]:
d1={
    "Name":["John","Alice","Bob","Emma"],
    "Age":[20,22,19,21],
    "Gender":["Male","Female","Male","Female"],
    "Marks":[88,92,75,89],
    "City":["New York","Los Angeles","Chicago","San Francisco"]
}

In [4]:
vr=pd.DataFrame(d1)
vr

    Name  Age  Gender  Marks           City
0   John   20    Male     88       New York
1  Alice   22  Female     92    Los Angeles
2    Bob   19    Male     75        Chicago
3   Emma   21  Female     89  San Francisco

In [6]:
vr[['Name','Marks']]

    Name  Marks
0   John     88
1  Alice     92
2    Bob     75
3   Emma     89

In [12]:
vr.head(2)

    Name  Age  Gender  Marks         City
0   John   20    Male     88     New York
1  Alice   22  Female     92  Los Angeles

In [19]:
vr.query("City=='Los Angeles'") #view only city named los angeles

    Name  Age  Gender  Marks         City
1  Alice   22  Female     92  Los Angeles

In [26]:
vr.query("Marks > 80") # view marks>80

    Name  Age  Gender  Marks           City
0   John   20    Male     88       New York
1  Alice   22  Female     92    Los Angeles
3   Emma   21  Female     89  San Francisco

In [25]:
vr.query("Gender=='Male'") #view only male

   Name  Age Gender  Marks      City
0  John   20   Male     88  New York
2   Bob   19   Male     75   Chicago

In [53]:
def grade(Marks):
    if Marks>=90:
        return "A"
    elif Marks>=80:
        return "B"
    else:
        return "C"

In [ ]:
vr=vr.drop(columns=["Grades"]) # drop column named grades

In [60]:
vr.loc[vr['Name']=='Bob',"Marks"]=80

In [66]:
vr["Grade"]=vr["Marks"].apply(grade) #add grade columns
vr

    Name  Age  Gender  Marks           City Grade         cars
0   John   20    Male     88       New York     B      Mustang
1  Alice   22  Female     92    Los Angeles     A  Lamborghini
2    Bob   19    Male     80        Chicago     B        BMWGT
3   Emma   21  Female     89  San Francisco     B       Virtus

In [67]:
cars=["Mustang","Lamborghini","BMW GT","Virtus GT"]
vr["cars"]=cars

In [70]:
vr=vr.drop(columns="cars")

In [71]:
vr

    Name  Age  Gender  Marks           City Grade
0   John   20    Male     88       New York     B
1  Alice   22  Female     92    Los Angeles     A
2    Bob   19    Male     80        Chicago     B
3   Emma   21  Female     89  San Francisco     B